{
  "title": "Bill Huang",
  "description": "Hi, I'm Bill. I do stuff on the internet.",
  "aboutlong": "My name is Bill Huang... <br> I was raised in the wintery city of Calgary, Alberta. In 2013, I left my hometown for Waterloo, Ontario in order to pursue an undergraduate degree in Computer Engineering. I have always possessed an interest for technology and this degree allows me to sate my curiosity. <br>If you have any questions or concerns, I can be reached through email at any time.",
  "aboutshort": "I am a fullstack software engineer interested in Frontend Web Design and Android application development. I am passionate about delivering the best possible experience to the end user. I am currently studying Computer Engineering at the University of Waterloo. ",
  "name": "Yichen Bill Huang",
  "location": "Toronto, Ontario, Canada",
  "email": "yichenhuang95@gmail.com",
  "phone": "+1 (403) 828-6082",
  "age": 22,
  "values": [
    {
        "imgSrc": "images/svg/values/code.svg",
        "value": "Code Quality",
        "description": "Maintain readability and uphold good coding practices."
    },
    {
        "imgSrc": "images/svg/values/feedback-loop.svg",
        "value": "Seek feedback",
        "description": "Actively seek feedback to incorporate into my work."
    },
    {
        "imgSrc": "images/svg/values/simplify.svg",
        "value": "Simplify",
        "description": "Strive for simplicity but not at the cost of quality."
    },
    {
        "imgSrc": "images/svg/values/fail.svg",
        "value": "Fail Gracefully",
        "description": "Embrace failure as part of the learning process."
    },
    {
        "imgSrc": "images/svg/values/learn.svg",
        "value": "Always Grow",
        "description": "Constantly strive to become a better developer and help others become better developers."
    },
    {
        "imgSrc": "images/svg/values/plan.svg",
        "value": "Plan Ahead",
        "description": "Always have a road map for future functionality and scalability. Never build blindly."
    }
  ],
  "experiences": [
    {
      "show": "True",
      "company": "Amazon Lab126",
      "title": "Software Engineer",
      "descriptionShort": "At Amazon, I was a part of the WebVideo team (formerly the YouTube team). When Google blocked YouTube from Amazon devices, we transitioned into displaying WebVideos from various sources (Vimeo, DailyMotion). With the WebVideo team, we pushed out a production ready product in 2 months to millions of Echo Show users.",
      "description": "",
      "location": "Sunnyvale, California",
      "dates": "(Spetember 2017 - December 2017)",
      "url": "https://www.google.com/maps/place/Sunnyvale,+CA/@37.3971408,-122.094161,12z/data=!3m1!4b1!4m5!3m4!1s0x808fb645a9d05d3b:0x768dfb26dd7cc3a2!8m2!3d37.36883!4d-122.0363496"
    },
    {
      "show": "True",
      "company": "Connected Lab",
      "title": "Software Engineer",
      "descriptionShort": "At Connected Lab, I aided product managers in translating technical requirements into a long term development plan and estimating development effort for each solution. I worked on a variety of web/mobile/server projects for numerous clients during my time here.",
      "description": "",
      "location": "Toronto, Ontario",
      "dates": "(Jan 2017 - April 2017)",
      "url": "https://www.google.ca/maps/place/171+E+Liberty+St+%23303,+Toronto,+ON+M6K+3P6/@43.6331596,-79.4141207,15z/data=!4m2!3m1!1s0x882b35038ee3e361:0xf323210028f78e7c?hl=en"
    },
    {
      "show": "True",
      "company": "Connected Lab",
      "title": "Software Engineer",
      "descriptionShort": "I helped build an internal resource management tool using the PERN stack (Postgres, Express, React, Node). Express was used for routing  I also performed RnD on the capabilities of React Native.",
      "description": "Connected Lab is a company that is building standalone mobile and web apps, while increasingly building ‘connected software’ across multiple devices and environments. At Connected Lab, I worked on the connected allocations web tool. The allocations web tool is an internal tool used by Connected Lab for resource, client, and project management. Functionalities for report/invoice generation was also implemented during my time at Connected. This project used ReactJS on a Node Framework. Swig was used for HTML templating PostgreSQL and Sequelize was used for the back end.",
      "location": "Toronto, Ontario",
      "dates": "(Jan 2016 - April 2016)",
      "url": "https://www.google.ca/maps/place/171+E+Liberty+St+%23303,+Toronto,+ON+M6K+3P6/@43.6331596,-79.4141207,15z/data=!4m2!3m1!1s0x882b35038ee3e361:0xf323210028f78e7c?hl=en"
    },
    {
      "show": "True",
      "company": "nanoPay",
      "title": "Frontend Developer",
      "descriptionShort": "While at nanoPay, I implemented UI/UX of an Android app as well as using AngularJS to build a responsive website with Rest API. I worked closely with designers to implement the designs and was responsible for high code quality.",
      "description": "nanoPay is a relatively new startup company that streamlines checkout and creates a smoother shopping experiences by delivering loyalty, coupons and payment with a single touch. I have had the pleasure to work for nanoPay as a Front End Developer, spending my time creating the loyalty portal that the clients of nanoPay will use. Here, I gained significant experience in development using AngularJS and also the Continuous Integration Software Development Cycle. I also started development on an mobile app for android using Android Studio.",
      "location": "Toronto, Ontario",
      "dates": "(May 2015 - August 2015)",
      "url": "https://www.google.ca/maps/place/171+E+Liberty+St+%23303,+Toronto,+ON+M6K+3P6/@43.6331596,-79.4141207,15z/data=!4m2!3m1!1s0x882b35038ee3e361:0xf323210028f78e7c?hl=en"
    },
    {
      "show": "False",
      "company": "PCL Intracon",
      "title": "Project Coordinator",
      "descriptionShort": "Test",
      "description": "The Kearl Expansion Project is an oil sands mine in the Athabasca Oil Sands Region in northern Alberta. I feel lucky to have played a part in both the construction portion as well as the quality control portion for the Electrical Heat Trace of this project. Here I learned more about the turnover to client process as I have worked at Kearl to it's completion in terms of EHT.",
      "location": "Fort McMurray, Alberta",
      "dates": "(Sept 2014 - Dec 2014)",
      "url": "https://www.google.ca/maps/place/171+E+Liberty+St+%23303,+Toronto,+ON+M6K+3P6/@43.6331596,-79.4141207,15z/data=!4m2!3m1!1s0x882b35038ee3e361:0xf323210028f78e7c?hl=en"
    },
    {
      "show": "False",
      "company": "Conoco Phillips Phase II",
      "title": "Project Coordinator",
      "descriptionShort": "Test",
      "description": "I have had the pleasure to have been apart of the team that is currently constructing the worlds largest Steam-assisted gravity drainage (or SAGD) facility in the world. Here, I gained extensive knowledge and experience with regards to Project Coordination and Project planning.",
      "location": "Fort McMurray, Alberta",
      "dates": "(Jan 2014 - April 2014)",
      "url": "https://www.google.ca/maps/place/171+E+Liberty+St+%23303,+Toronto,+ON+M6K+3P6/@43.6331596,-79.4141207,15z/data=!4m2!3m1!1s0x882b35038ee3e361:0xf323210028f78e7c?hl=en"
    },
    {
      "show": "False",
      "company": "Alberta Health Services",
      "title": "Health Intern",
      "description": "I spent the summer of 2012 working for Alberta Health Services as a dietician intern. A fellow intern and I lead a research project on celiac disease as well as working on a celiac disease support group.",
      "location": "Calgary, Alberta",
      "dates": "(Sept 2014 - Dec 2014)",
      "url": "https://www.google.ca/maps/place/Calgary,+AB/@51.013117,-114.0741556,10z/data=!3m1!4b1!4m2!3m1!1s0x537170039f843fd5:0x266d3bb1b652b63a"
    }
  ],
  "projects": [
    {
      "show": "False",
      "name": "Morse Code Translator",
      "description": "Takes in string inputs and outputs morse signals. Programmed using an ARM board and assembly language.",
      "src": "images/projects/armboard.png"
    },
    {
      "show": "True",
      "name": "Alexa Rap Bot",
      "description": "Node project that uses AWS Lambda and DynamoDB to create an application that allows you to participate in a rap battle with Alexa.",
      "src": "images/projects/echohackathon.jpg"
    },
    {
      "show": "True",
      "name": "TapExchange",
      "description": "TapExchange is a simple phone app that allows users to transmit contact info via NFC.",
      "src": "images/projects/tapExchange.png"
    },
    {
      "show": "True",
      "name": "Blogging Site",
      "description": "A Blogging website created from scratch for a friend.",
      "src": "images/projects/blog.png"
    },
    {
      "show": "True",
      "name": "Android Pedometer",
      "description": "Designed and implemented Android Pedometer using finite state machines and sensor event handlers. Contains map loading and path finding capabilities.",
      "src": "images/projects/pedometer.png"
    },
    {
      "show": "False",
      "name": "Reaction Timer",
      "description": "Designed a program using the ARM board that records the reaction time of user based on LED stimulus and button input.",
      "src": "images/projects/reaction.jpg"
    },
    {
      "show": "False",
      "name": "Traffic light system",
      "description": "Designed and programmed a 4-way traffic light system on a FPGA board using VHDL programming language",
      "src": "images/projects/trafficlight.jpg"
    },
    {
      "show": "True",
      "name": "Pong",
      "description": "A Recreation of the classic game of Pong using Unity.",
      "src": "images/projects/pong.png"
    },
    {
      "show": "True",
      "name": "Portfolio sites",
      "description": "Portfolio style website created using Node, Express and Pug",
      "src": "images/projects/portfolio-site.png"
    },
    {
      "show": "True",
      "name": "Casty",
      "description": "A household movie queue and streaming device for the raspberry pi.",
      "src": "images/projects/casty.png"
    },
    {
      "show": "True",
      "name": "Palette",
      "description": "Analyzes an image/camera feed and grabs a custom color palette",
      "src": "images/projects/palette.png"
    }
  ]
}
